SOA/D84361GC10_labs/labs/files/xml_in/approval_input.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
 <soap:Body xmlns:ns1="http://www.example.org/ns/intorder">
  <ns1:order>
   <ns1:customerId>1</ns1:customerId>
   <ns1:orderId>100</ns1:orderId>
   <ns1:payMethod>credit</ns1:payMethod>
   <ns1:shipMethod>two_day</ns1:shipMethod>
   <ns1:orderTotal>135</ns1:orderTotal>
   <ns1:status>initial</ns1:status>
   <ns1:creditCard>
      <ns1:cardType>VISTA</ns1:cardType>
      <ns1:cardNumber>1234-1234-1234-1234</ns1:cardNumber>
   </ns1:creditCard>
   <ns1:items>
      <ns1:inStock>true</ns1:inStock>
      <ns1:item>
         <ns1:prodId>SKU301</ns1:prodId>
         <ns1:prodName>Music Player 1Gb</ns1:prodName>
         <ns1:price>45</ns1:price>
         <ns1:qty>3</ns1:qty>
         <ns1:itemTotal>135</ns1:itemTotal>
      </ns1:item>    
   </ns1:items>
  </ns1:order>
 </soap:Body>
</soap:Envelope>
